KanatERPSukhova.КанатАдаптация/src/Documents/ЗаданиеНаПеревозку/ЗаданиеНаПеревозку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d371a3f9-8a6a-4f41-8820-d9a12b2d57af">
  <name>ЗаданиеНаПеревозку</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:Document>

KanatERPSukhova.КанатАдаптация/src/Enums/СпособыДоставки/СпособыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e84f811f-b8c6-4c9c-9e98-f10ab90f1702">
  <name>СпособыДоставки</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="066e8fb0-3813-4481-b4bf-edfafab4aed9">
    <name>СиламиПеревозчикаПоАдресу</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f442a653-b32b-4be9-9b5e-4a5abb206d85">
    <name>Самовывоз</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="3c09e30d-ef7d-4e10-9b7e-c3d470857e36">
    <name>ДоКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b983ffd7-6fee-4341-823c-bc970e783c64">
    <name>СиламиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c07693f6-6c15-46b9-8ea5-6560cf995152">
    <name>КПолучателюОпределяетСлужбаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

KanatERPSukhova.КанатАдаптация/src/Documents/РасходныйОрдерНаТовары/РасходныйОрдерНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e5b57481-c7d7-459c-8f38-003976928dcf">
  <name>РасходныйОрдерНаТовары</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>КАНАТ_ВсегоСерий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections extendedConfigurationObject="f93cbc89-602b-4c37-a90c-1bceda80afe7">
    <name>ТоварыПоРаспоряжениям</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>КАНАТ_КомментарийКЗаказу</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>400</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КАНАТ_Сертификат</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="389dae2c-5f04-4c10-8555-7103bd0c3f21">
    <name>ОтгружаемыеТовары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>КАНАТ_КомментарийКЗаказу</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>400</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КАНАТ_Сертификат</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="152a5a3e-8c56-4983-9052-b8b75a6e0d12">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="93ae14aa-f407-4566-96ba-2cbba0eadcc2">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="26cd1a83-599c-4cb2-88f4-8da57cd2dfaf">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

KanatERPSukhova.КанатАдаптация/src/Documents/ЗаданиеНаПеревозку/ManagerModule.bsl
&ИзменениеИКонтроль("СформироватьПечатнуюФормуМаршрутныйЛист")
Функция КАНАТ_СформироватьПечатнуюФормуМаршрутныйЛист(МассивОбъектов, ОбъектыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы  = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаданиеНаПеревозку_МаршрутныйЛист";
	#Удаление
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаданиеНаПеревозку.ПФ_MXL_МаршрутныйЛист");
	#КонецУдаления	 
	#Вставка
	//БИТ_Гурьев__02.04.24++
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаданиеНаПеревозку.КАНАТ_ПФ_MXL_МаршрутныйЛист");
	//БИТ_Гурьев__02.04.24--
	#КонецВставки

	ОбластьЗаголовокДокумента		= Макет.ПолучитьОбласть("ЗаголовокДокумента");
	ОбластьШапкаДокумента 			= Макет.ПолучитьОбласть("ШапкаДокумента");
	ОбластьДополнительнаяИнформация = Макет.ПолучитьОбласть("ДополнительнаяИнформация");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасходныйОрдер.Ссылка КАК Ордер,
	|	РаспоряженияЗаданий.Распоряжение КАК Распоряжение
	|ПОМЕСТИТЬ РаспоряженияОрдеровПоПолучателям
	|ИЗ
	|	Документ.ЗаданиеНаПеревозку.Распоряжения КАК РаспоряженияЗаданий
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары КАК РасходныйОрдер
	|		ПО РаспоряженияЗаданий.Ссылка = РасходныйОрдер.ЗаданиеНаПеревозку
	|			И РаспоряженияЗаданий.ПолучательОтправитель = РасходныйОрдер.Получатель
	|			И (НЕ РасходныйОрдер.ПометкаУдаления)
	|ГДЕ
	|	РаспоряженияЗаданий.Ссылка В(&МассивОбъектов)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасходныйОрдер.Ссылка,
	|	РаспоряженияЗаданий.Распоряжение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РаспоряженияЗаданий.Ссылка КАК Задание,
	|	РаспоряженияЗаданий.Распоряжение КАК Распоряжение,
	|	ЕСТЬNULL(РаспоряженияОрдеров.Ссылка, ЗНАЧЕНИЕ(Документ.РасходныйОрдерНаТовары.ПустаяСсылка)) КАК Ордер
	|ПОМЕСТИТЬ ОрдераЗаданий
	|ИЗ
	|	Документ.ЗаданиеНаПеревозку.Распоряжения КАК РаспоряженияЗаданий
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РаспоряженияОрдеров
	|		ПО РаспоряженияЗаданий.Распоряжение = РаспоряженияОрдеров.Распоряжение
	|			И (НЕ РаспоряженияОрдеров.Ссылка.ПометкаУдаления)
	|ГДЕ
	|	РаспоряженияЗаданий.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РаспоряженияЗаданий.Ссылка КАК Ссылка,
	|	РаспоряженияЗаданий.ПолучательОтправитель КАК Получатель,
	|	РаспоряженияЗаданий.Распоряжение КАК Распоряжение,
	|	РаспоряженияЗаданий.КлючСвязи КАК КлючСвязи,
	|	РаспоряженияЗаданий.НомерСтроки КАК НомерСтроки,
	|	РаспоряженияЗаданий.Вес КАК Вес,
	|	РаспоряженияЗаданий.Объем КАК Объем,
	#Вставка     
	|	ОрдераЗаданий.Ордер       КАК Ордер,
	#КонецВставки
	|	ЕСТЬNULL(СУММА(ОтгружаемыеТовары.КоличествоУпаковок), 0) КАК КоличествоМест
	|ПОМЕСТИТЬ РаспоряженияОрдеров
	|ИЗ
	|	Документ.ЗаданиеНаПеревозку.Распоряжения КАК РаспоряженияЗаданий
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОрдераЗаданий КАК ОрдераЗаданий
	|		ПО РаспоряженияЗаданий.Ссылка = ОрдераЗаданий.Задание
	|			И РаспоряженияЗаданий.Распоряжение = ОрдераЗаданий.Распоряжение
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары.ОтгружаемыеТовары КАК ОтгружаемыеТовары
	|		ПО (ОрдераЗаданий.Ордер = ОтгружаемыеТовары.Ссылка)
	|			И (ОтгружаемыеТовары.УпаковочныйЛистРодитель = ЗНАЧЕНИЕ(Документ.УпаковочныйЛист.ПустаяСсылка))
	|ГДЕ
	|	РаспоряженияЗаданий.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	РаспоряженияЗаданий.Ссылка,
	|	РаспоряженияЗаданий.ПолучательОтправитель,
	|	РаспоряженияЗаданий.Распоряжение,
	|	РаспоряженияЗаданий.КлючСвязи,
	|	РаспоряженияЗаданий.НомерСтроки,
	|	РаспоряженияЗаданий.Вес,
	|	РаспоряженияЗаданий.Объем
	#Вставка 
	|	,
	|	ОрдераЗаданий.Ордер
	#КонецВставки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РаспоряженияЗаданий.КлючСвязи,
	|	РаспоряженияЗаданий.Распоряжение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаданиеНаПеревозку.Ссылка КАК Ссылка,
	|	ЗаданиеНаПеревозку.Номер КАК НомерЗадания,
	|	ЗаданиеНаПеревозку.Дата КАК Дата,
	|	ПРЕДСТАВЛЕНИЕ(ЗаданиеНаПеревозку.Водитель) КАК ВодительНаименование,
	|	ЗаданиеНаПеревозку.ВодительФИО КАК Водитель,
	|	ПРЕДСТАВЛЕНИЕ(ЗаданиеНаПеревозку.КурьерЭкспедитор) КАК КурьерЭкспедитор,
	|	ПРЕДСТАВЛЕНИЕ(ЗаданиеНаПеревозку.ТранспортноеСредство) КАК ТранспортноеСредствоНаименование,
	|	СОКРЛП(ЗаданиеНаПеревозку.АвтомобильГосударственныйНомер) + "" "" + СОКРЛП(ЗаданиеНаПеревозку.АвтомобильМарка) КАК ТранспортноеСредство,
	|	ЗаданиеНаПеревозку.Приоритет КАК Приоритет,
	|	ЗаданиеНаПеревозку.ДатаВремяРейсаПланС КАК НачалоРейсаПлан,
	|	ЗаданиеНаПеревозку.ДатаВремяРейсаПланПо КАК ОкончаниеРейсаПлан,
	|	ЗаданиеНаПеревозку.ДатаВремяРейсаФактС КАК НачалоРейсаФакт,
	|	ЗаданиеНаПеревозку.ДатаВремяРейсаФактПо КАК ОкончаниеРейсаФакт,
	|	ЗаданиеНаПеревозку.ДополнительнаяИнформация КАК ДопИнформация,
	|	ЗаданиеНаПеревозку.Вес КАК ИтогоВес,
	|	ЗаданиеНаПеревозку.Объем КАК ИтогоОбъем
	|ИЗ
	|	Документ.ЗаданиеНаПеревозку КАК ЗаданиеНаПеревозку
	|ГДЕ
	|	ЗаданиеНаПеревозку.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаданиеНаПеревозку.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаршрутЗадания.Ссылка КАК Ссылка,
	|	МаршрутЗадания.Адрес КАК Адрес,
	|	МаршрутЗадания.Зона КАК Зона,
	|	МаршрутЗадания.ВремяС КАК ВремяС,
	|	МаршрутЗадания.ВремяПо КАК ВремяПо,
	|	ВЫРАЗИТЬ(МаршрутЗадания.ДополнительнаяИнформация КАК СТРОКА(1000)) КАК ДополнительнаяИнформация,
	|	РаспоряженияОрдеров.Получатель КАК Получатель,
	|	РаспоряженияОрдеров.Распоряжение КАК Распоряжение,
	|	РаспоряженияОрдеров.Распоряжение.Номер КАК НомерРаспоряжения,
	|	СУММА(РаспоряженияОрдеров.Вес) КАК Вес,
	|	СУММА(РаспоряженияОрдеров.Объем) КАК Объем, 
	#Удаление
	|	РаспоряженияОрдеров.КоличествоМест КАК КоличествоМест 
	#КонецУдаления
	#Вставка     
	//БИТ_Гурьев__02.04.24++
	|	РаспоряженияОрдеров.Ордер.КАНАТ_ВсегоСерий КАК КоличествоМест
	//БИТ_Гурьев__02.04.24--
	#КонецВставки
	|ИЗ
	|	Документ.ЗаданиеНаПеревозку.Маршрут КАК МаршрутЗадания
	|		ЛЕВОЕ СОЕДИНЕНИЕ РаспоряженияОрдеров КАК РаспоряженияОрдеров
	|		ПО МаршрутЗадания.КлючСвязи = РаспоряженияОрдеров.КлючСвязи
	|ГДЕ
	|	МаршрутЗадания.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	МаршрутЗадания.Ссылка,
	|	МаршрутЗадания.НомерСтроки,
	|	МаршрутЗадания.КлючСвязи,
	|	МаршрутЗадания.Адрес,
	|	МаршрутЗадания.Зона,
	|	МаршрутЗадания.ВремяС,
	|	МаршрутЗадания.ВремяПо,
	|	ВЫРАЗИТЬ(МаршрутЗадания.ДополнительнаяИнформация КАК СТРОКА(1000)),
	|	РаспоряженияОрдеров.Получатель,
	|	РаспоряженияОрдеров.Распоряжение,
	|	РаспоряженияОрдеров.Распоряжение.Номер,
	|	РаспоряженияОрдеров.КоличествоМест  
	#Вставка     
	////БИТ_Гурьев__02.04.24++
	|	,
	|	РаспоряженияОрдеров.Ордер.КАНАТ_ВсегоСерий
	//БИТ_Гурьев__02.04.24--	
	#КонецВставки
	|
	|УПОРЯДОЧИТЬ ПО
	|	МаршрутЗадания.Ссылка,
	|	МаршрутЗадания.НомерСтроки,
	|	МИНИМУМ(РаспоряженияОрдеров.НомерСтроки)
	|ИТОГИ ПО
	|	Ссылка,
	|	МаршрутЗадания.НомерСтроки,
	|	МаршрутЗадания.КлючСвязи,
	|	Получатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Распоряжения.Склад КАК Склад,
	|	Распоряжения.Склад.ИспользоватьОрдернуюСхемуПриОтгрузке
	|		И Распоряжения.Склад.ДатаНачалаОрдернойСхемыПриОтгрузке <= Распоряжения.Распоряжение.Дата КАК ОрдернаяСхемаПриОтгрузке
	|ИЗ
	|	Документ.ЗаданиеНаПеревозку.Распоряжения КАК Распоряжения
	|ГДЕ
	|	Распоряжения.Ссылка В(&МассивОбъектов)
	|	И НЕ Распоряжения.Склад.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	РезультатЗапросаПоДокументу = Запрос.ВыполнитьПакет(); 
	
	РезультатШапкаДокументов = РезультатЗапросаПоДокументу[3].Выбрать();
	ВыборкаПоСсылкам         = РезультатЗапросаПоДокументу[4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	СкладыПогрузкиВыборка    = РезультатЗапросаПоДокументу[5].Выбрать();
	
	ПервыйДокумент = Истина;
	
	Пока РезультатШапкаДокументов.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		РеквизитыДокумента = Новый Структура;
		РеквизитыДокумента.Вставить("Номер", РезультатШапкаДокументов.НомерЗадания);
		РеквизитыДокумента.Вставить("Дата",  РезультатШапкаДокументов.Дата);
		
		НазваниеДокумента = НСтр("ru = 'Маршрутный лист';
								|en = 'Operation sheet'", ОбщегоНазначения.КодОсновногоЯзыка());
		
		ЗаголовокДокумента = ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(РеквизитыДокумента,
																							НазваниеДокумента);
		ОбластьЗаголовокДокумента.Параметры.ЗаголовокДокумента = ЗаголовокДокумента;
		
		ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент,
																		Макет,
																		ОбластьЗаголовокДокумента,
																		РезультатШапкаДокументов.Ссылка);
		
		ТабличныйДокумент.Вывести(ОбластьЗаголовокДокумента);
		
		ОбластьШапкаДокумента.Параметры.Заполнить(РезультатШапкаДокументов);
		
		СтрокаСкладыПогрузки = "";
		ЕстьОрдерныеСклады   = Ложь;
		
		Пока СкладыПогрузкиВыборка.Следующий() Цикл
			Если СкладыПогрузкиВыборка.ОрдернаяСхемаПриОтгрузке
				И Не ЕстьОрдерныеСклады Тогда
				
				ЕстьОрдерныеСклады = Истина;
				
			КонецЕсли;
			
			СтрокаСкладыПогрузки = СтрокаСкладыПогрузки + СкладыПогрузкиВыборка.Склад + "," + Символы.НПП;
		КонецЦикла;
		
		СуффиксОбласти = ?(Не ЕстьОрдерныеСклады, "БезМест", "");
		
		ОбластьШапкаТаблицы		= Макет.ПолучитьОбласть("ШапкаТаблицы" + СуффиксОбласти);
		ОбластьСтрокаТаблицы	= Макет.ПолучитьОбласть("СтрокаТаблицы" + СуффиксОбласти);
		ОбластьДопСтрокаТаблицы	= Макет.ПолучитьОбласть("ДопСтрокаТаблицы" + СуффиксОбласти);
		ОбластьПодвалТаблицы 	= Макет.ПолучитьОбласть("ПодвалТаблицы" + СуффиксОбласти);
		ОбластьИтоги 			= Макет.ПолучитьОбласть("Итоги" + СуффиксОбласти);
		
		Если СтрокаСкладыПогрузки <> "" Тогда
			СтрокаСкладыПогрузки = Лев(СтрокаСкладыПогрузки, СтрДлина(СтрокаСкладыПогрузки) - 2);
			
			ОбластьШапкаДокумента.Параметры.СкладыПогрузки = СтрокаСкладыПогрузки;
		КонецЕсли;
		
		Если ПустаяСтрока(ОбластьШапкаДокумента.Параметры.ТранспортноеСредство) Тогда
			ОбластьШапкаДокумента.Параметры.ТранспортноеСредство = РезультатШапкаДокументов.ТранспортноеСредствоНаименование;
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьШапкаДокумента);
		
		ОтборПоиска = Новый Структура ("Ссылка", РезультатШапкаДокументов.Ссылка);
		
		Пока ВыборкаПоСсылкам.НайтиСледующий(ОтборПоиска) Цикл
			
			ИмяСтолбцаВес   = НСтр("ru = 'Вес, %ЕдиницаИзмеренияВес%';
									|en = 'Weight, %ЕдиницаИзмеренияВес%'", ОбщегоНазначения.КодОсновногоЯзыка());
			ИмяСтолбцаОбъем = НСтр("ru = 'Объем, %ЕдиницаИзмеренияОбъем%';
									|en = 'Volume, %ЕдиницаИзмеренияОбъем%'", ОбщегоНазначения.КодОсновногоЯзыка());
			
			ИмяСтолбцаВес   = СтрЗаменить(ИмяСтолбцаВес,
										"%ЕдиницаИзмеренияВес%",
										Константы.ЕдиницаИзмеренияВеса.Получить());
			ИмяСтолбцаОбъем = СтрЗаменить(ИмяСтолбцаОбъем,
										"%ЕдиницаИзмеренияОбъем%",
										Константы.ЕдиницаИзмеренияОбъема.Получить());
			
			НаименованияКолонокТаблицы = Новый Структура("ВесШапка, ОбъемШапка", ИмяСтолбцаВес, ИмяСтолбцаОбъем);
			
			ОбластьШапкаТаблицы.Параметры.Заполнить(НаименованияКолонокТаблицы);
			
			ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
			
			ВыборкаПоНомерамСтрок = ВыборкаПоСсылкам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			НомерСтроки = 0;
			ИтогоКоличествоМест = 0;
			
			Пока ВыборкаПоНомерамСтрок.Следующий() Цикл
			
				ВыборкаПоКодамСтрок = ВыборкаПоНомерамСтрок.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаПоКодамСтрок.Следующий() Цикл
					
					НомерСтроки = НомерСтроки + 1;
					
					ОбластьСтрокаТаблицы.Параметры.НомерЗаказа = НомерСтроки;
					
					ВыборкаПоПолучателям = ВыборкаПоКодамСтрок.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					ПервыйПолучатель = Истина;
					
					КоличествоПолучателей = ВыборкаПоПолучателям.Количество() - 1;
					
					Пока ВыборкаПоПолучателям.Следующий() Цикл
						
						Если ПервыйПолучатель Тогда
							ПервыйПолучатель = Ложь;
							
							ЗаполняемаяОбласть = ОбластьСтрокаТаблицы;
						Иначе
							ЗаполняемаяОбласть = ОбластьДопСтрокаТаблицы;
						КонецЕсли;
						
						ИтогоВес   = 0;
						ИтогоОбъем = 0;
						
						КоличествоМестПоСтроке = 0;
						
						Распоряжения = Новый Соответствие;
						
						Выборка = ВыборкаПоПолучателям.Выбрать();
						
						Пока Выборка.Следующий() Цикл
							ИтогоВес   = ИтогоВес + Выборка.Вес;
							ИтогоОбъем = ИтогоОбъем + Выборка.Объем;
							
							КоличествоМестПоСтроке = Выборка.КоличествоМест;
							
							ЗаполняемаяОбласть.Параметры.Заполнить(Выборка);
							#Вставка
							//БИТ_Гурьев__02.04.24++
							ЗаполняемаяОбласть.Параметры.Грузоперевозчик = "";
							ЗаполняемаяОбласть.Параметры.Плательщик = "";
							Если ТипЗнч(Выборка.Распоряжение) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
								
								
								СпособДоставки = Выборка.Распоряжение.СпособДоставки;
								Если СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчика ИЛИ
									СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу Тогда
									ЗаполняемаяОбласть.Параметры.Грузоперевозчик = Выборка.Распоряжение.ПеревозчикПартнер;
									
								КонецЕсли;
								
								ЗаполняемаяОбласть.Параметры.Плательщик = Выборка.Распоряжение.КАНАТ_ПлатитЗаДоставку;
								
							КонецЕсли;
							//БИТ_Гурьев__02.04.24--
							#КонецВставки

							СтрокаРаспоряжения = Распоряжения.Получить(Выборка.Распоряжение.Метаданные());
							
							Если СтрокаРаспоряжения = Неопределено Тогда
								СтрокаРаспоряжения = Выборка.Распоряжение.Метаданные().ПредставлениеСписка + ": "
													+ ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.НомерРаспоряжения);
							Иначе
								СтрокаРаспоряжения = СтрокаРаспоряжения + "," + " "
									+ ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.Распоряжение.Номер);
							КонецЕсли;
							
							Распоряжения.Вставить(Выборка.Распоряжение.Метаданные(), СтрокаРаспоряжения);
						КонецЦикла;
						
						ИтогоКоличествоМест = ИтогоКоличествоМест + КоличествоМестПоСтроке;
						
						ИменаРаспоряжений = "";
						
						Для Каждого РаспоряжениеКлючЗначение Из Распоряжения Цикл
							ИменаРаспоряжений = ИменаРаспоряжений + РаспоряжениеКлючЗначение.Значение + Символы.ПС;
						КонецЦикла;
						
						ПараметрыГрузаПолучателя = Новый Структура;
						ПараметрыГрузаПолучателя.Вставить("Распоряжения",   ИменаРаспоряжений);
						ПараметрыГрузаПолучателя.Вставить("Вес",            ИтогоВес);
						ПараметрыГрузаПолучателя.Вставить("Объем",          ИтогоОбъем);
						ПараметрыГрузаПолучателя.Вставить("КоличествоМест", КоличествоМестПоСтроке);
						
						ЗаполняемаяОбласть.Параметры.Заполнить(ПараметрыГрузаПолучателя);
						
						ТабличныйДокумент.Вывести(ЗаполняемаяОбласть);
						
					КонецЦикла;
					
					ОбъединитьОбластьСоСтрокамиНиже(ТабличныйДокумент,
													"НомерЗаказа" + СуффиксОбласти,
													КоличествоПолучателей);
					ОбъединитьОбластьСоСтрокамиНиже(ТабличныйДокумент,
													"Адрес" + СуффиксОбласти,
													КоличествоПолучателей);
					ОбъединитьОбластьСоСтрокамиНиже(ТабличныйДокумент,
													"Зона" + СуффиксОбласти,
													КоличествоПолучателей);
					ОбъединитьОбластьСоСтрокамиНиже(ТабличныйДокумент,
													"ВремяС" + СуффиксОбласти,
													КоличествоПолучателей);
					ОбъединитьОбластьСоСтрокамиНиже(ТабличныйДокумент,
													"ВремяПо" + СуффиксОбласти,
													КоличествоПолучателей);
					ОбъединитьОбластьСоСтрокамиНиже(ТабличныйДокумент,
													"ДополнительнаяИнформацияСтрока" + СуффиксОбласти,
													КоличествоПолучателей);
					
				КонецЦикла;
			
			КонецЦикла;
			
			ТабличныйДокумент.Вывести(ОбластьПодвалТаблицы);
			
			ВесПоДокументу   = РезультатШапкаДокументов.ИтогоВес
								/ НоменклатураСервер.КоэффициентПересчетаВТонны(Константы.ЕдиницаИзмеренияВеса.Получить());
			ОбъемПоДокументу = РезультатШапкаДокументов.ИтогоОбъем
								/ НоменклатураСервер.КоэффициентПересчетаВКубическиеМетры(Константы.ЕдиницаИзмеренияОбъема.Получить());
			
			ПараметрыИтогов = Новый Структура;
			ПараметрыИтогов.Вставить("ИтогоВес",   ВесПоДокументу);
			ПараметрыИтогов.Вставить("ИтогоОбъем", ОбъемПоДокументу);
			
			Если ЕстьОрдерныеСклады Тогда
				ПараметрыИтогов.Вставить("ИтогоКоличествоМест", ИтогоКоличествоМест);
			КонецЕсли;
			
			ОбластьИтоги.Параметры.Заполнить(ПараметрыИтогов);
			
			ТабличныйДокумент.Вывести(ОбластьИтоги);
			
			Если ЗначениеЗаполнено(РезультатШапкаДокументов.ДопИнформация) Тогда
				ОбластьДополнительнаяИнформация.Параметры.ДопИнформация = СокрЛП(РезультатШапкаДокументов.ДопИнформация);
				
				ТабличныйДокумент.Вывести(ОбластьДополнительнаяИнформация);
			КонецЕсли;
			
		КонецЦикла;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,
														НомерСтрокиНачало,
														ОбъектыПечати,
														РезультатШапкаДокументов.Ссылка);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции
